/**
 * z_en_clear_tag.c
 *
 * A faithful rewrite of the Arwing from OoT.
 *
 * by Dr.Disco
 *
 * variable structure
 *  0000 - Plays cutscene
 *  0064 - Laser
 **/

#include <z64ovl/oot/debug.h>
#include <z64ovl/oot/helpers.h>
#include "zobj.h" /* embedded geometry & textures */

#define OBJ_ID 1
#define ARWING_HEALTH   1  // TODO normally 3, but 1 makes testing easier

// TODO
// improve readability
// finish documenting structures
// name unnamed external functions
// eliminate gotos
// more comments to explain what does what

// possibly TODO: SRD+1
// prim.a fades to 0 and the particle knows it's finished once it reaches 0.
// consider making the smoke particle gradually fade out instead of just
// disappearing. If this is implemented, make it toggle-able via a SRD_PLUS_1
// macro

enum arwing_draw_mode
{
	  DRAW_MODELS_ONLY     = 0
	, DRAW_BOTH            = 1
	, DRAW_PARTICLES_ONLY  = 2
};

enum arwing_particle_type
{
	  PARTICLE_AVAILABLE  = 0
	, PARTICLE_DEBRIS     = 1
	, PARTICLE_FIRE       = 2
	, PARTICLE_SMOKE      = 3
	, PARTICLE_FLASH      = 4
};

#define GFX global->common.gfx_ctxt
#define GFX_POLY_OPA ZQDL( global, poly_opa )
#define GFX_POLY_XLU ZQDL( global, poly_xlu )

typedef struct {
	z64_actor_t actor;      /* 0x0000 */ /* length 0x13C */
	uint8_t unk13C[0x10];   /* 0x013C */ // unused, likely padding
	uint8_t                 /* 0x014C */
		  spawn_explosion   // is set when the Arwing falls and hits the ground
		, draw_mode         /* 0 = models only, 2 = particles only, 1 = both */
		, unk14E            /* seems to be a state based thing */
		, unk14F
	;
	int16_t
		  unk150[3]         /* 0x0150 */
	;
	uint8_t unk156[2];      /* 0x0156 */ // likely padding
	vec3f_t unk158, unk164; /* 0x0158 */
	vec3f_t unk170;         /* 0x0170 */ // physics related, acceleration/deceleration
	uint8_t unk17C, unk17D; /* 0x017C */
	uint8_t unk17E[2];      /* 0x017E */ // likely padding
	float unk180;           /* 0x0180 */
	int16_t unk184, unk186; /* 0x0184 */
	vec3f_t up;             /* 0x0188 */ /* "up" vector, so that the flash
	                                        particle can radiate across
	                                        surfaces of any angle: even walls! */
	z64_capsule_t capsule;  /* 0x0194 */ /* length 0x4C */
	uint8_t
		  cutscene_mode     /* 0x01E0 */
		, padding;
	uint16_t
		camera_id           /* 0x01E2 */
	;
	vec3f_t camera_lookat;  /* 0x01E4 */ // camera look-at
	vec3f_t camera_pos;     /* 0x01F0 */ // camera position
	uint16_t cutscene_time; /* 0x01FC */ // time remaining in cutscene
	uint8_t unk1FE[6];      /* 0x01FE */ // unused
} entity_t; /* 0x0204 bytes */


typedef struct arwing_particle {
	uint8_t
		  type     // 0 if not in use, particle ID otherwise
		, seed     // seed, randomized on spawn
		, pad0
		, pad1
	;
	vec3f_t
		  pos
		, vel
		, acc
	;
	rgbaf_t
		  prim     // primitive color
		, env      // environment color
	;
	int16_t
		  bounces  // number of times particle has bounced off ground
		, timer    // counts frames to expire (not used by all types)
	;
	float
		  scale    // scale
		, scale_b  // some particles gradually resize from scale to scale_b
	;
	vec3f_t
		  rot      // rotation of the particle (used only by debris)
		, up       // "up" vector, so that the flash particle can
	               // radiate across surfaces of any angle: even walls!
	               // TODO this may just be reclassified as rot_b
	;
} arwing_particle_t; /* 0x6C bytes */





/*** variables ***/
static uint8_t data_809DC3D0[10800]={0};
uint32_t data_809D5C30 = 0;

